# Baby Names

### Data in Motion: Data Analysis Challenge 4

## Scenario
You are a data analyst and you have been tasked with summarizing data about the occurrence of baby names. Your manager would like the following questions answered.

## Dataset Link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

## Questions
- See the first 10 entries.
- Delete the columns ‘Unnamed: 0’ and ‘Id’.
- Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.
- How many different names exist in the dataset?
- What is the name with most occurrences?
- What is the standard deviation of count of names?
- Get a summary of the dataset with the mean, min, max, std and quartiles.

### Import Libraries

In [1]:
import pandas as pd

### Load the Dataset

In [3]:
data = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

### Exploring the dataset

In [4]:
data.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [6]:
# See the first 10 entries.
data.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [8]:
# Delete the columns ‘Unnamed: 0’ and ‘Id’.
data = data.drop(columns=['Unnamed: 0','Id'])
data.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [17]:
# Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.
names = data.groupby(['Name']).sum().sort_values(['Count'], ascending= False)
names

C:\Users\getan\AppData\Local\Temp\ipykernel_21356\1196641670.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names = data.groupby(['Name']).sum().sort_values(['Count'], ascending= False)

               Year   Count
Name
Jacob       1141099  242874
Emma        1137085  214852
Michael     1161152  214405
Ethan       1139091  209277
Isabella    1137090  204798
...             ...     ...
Eniola         2012       5
Atlantis       2005       5
Marci          2004       5
Simarpreet     2011       5
Nita           2007       5

[17632 rows x 2 columns]

In [18]:
# How many different names exist in the dataset?
data['Name'].nunique()

17632

In [20]:
# What is the name with most occurrences?
names['Count'].head(1)

Name
Jacob    242874
Name: Count, dtype: int64

In [23]:
# What is the standard deviation of count of names?
names['Count'].std()

11006.069467890571

In [24]:
# Get a summary of the dataset with the mean, min, max, std and quartiles.
data.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03